Revit 2027 API
BuiltInFailures.GeometryFailures.SymbolicLineInvalidPlane Property
 Symbolic Element refers to a Work Plane with unacceptable normal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SymbolicLineInvalidPlane { get; }
Public Shared ReadOnly Property SymbolicLineInvalidPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SymbolicLineInvalidPlane {
	FailureDefinitionId^ get ();
}
static member SymbolicLineInvalidPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace